asuFlumeCleanCases/2dAsuFlume_singleParticle_alcoholMix/0/alpha.particles1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volScalarField;
    location    "0";
    object      alpha.particles1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{

  inlet
    {
      type            codedFixedValue;
      value           uniform 0;  // Default initial value
      name            timeDependentAlpha1;  // Unique name for the boundary condition

      code
	#{
        scalar t = this->db().time().value();
      scalarField& field = *this;

      // Set alpha value based on time
      if ((t >= 0.0) && (t <= 2.0))
        {
	  field = scalar(0.15);  // Set alpha value to 0.3
        }
      else
        {
	  field = scalar(0.0);  // Set alpha value to 0.0
        }
      #};
    }
   top
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    groundAndWall
    {
        type            zeroGradient;
    }
    axis
    {
        type            zeroGradient;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
