asuFlumeCleanCases/2dAsuFlume_singleParticle_alcoholMix/0/muMix
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volScalarField;
    location    "0";
    object      muMix;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0.00089;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0.00248093084685;
    }
    top
    {
        type            calculated;
        value           uniform 0.00089;
    }
    groundAndWall
    {
        type            calculated;
        value           uniform 0.00089;
    }
    axis
    {
        type            calculated;
        value           uniform 0.00089;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
