asuFlumeCleanCases/2dAsuFlume_singleParticle_alcoholMix/0/water.liquid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volScalarField;
    location    "0";
    object      water.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{

inlet
{
    type            fixedValue;
    value           uniform 0.95;  // inlet value
 }
  top
    {
        type            inletOutlet;
        inletValue uniform 1;
        value           uniform 1;
    }
    groundAndWall
    {
        type            zeroGradient;
    }
    axis
    {
        type            zeroGradient;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
